# ProgressDlgClose

## Description
Close the progress dialog opened with ProgressDlgOpen.

```pascal
PROCEDURE ProgressDlgClose;
```

```python
def vs.ProgressDlgClose():
    return None
```

## Examples
les can be found at [[VS:Progress Dialog]].

```pascal
ProgressDlgClose;
```
```python
import vs

# Close the progress dialog opened with ProgressDlgOpen.
vs.ProgressDlgClose()
```

## See Also
ProgressDlgOpen | ProgressDlgClose | ProgressDlgSetTopMsg | ProgressDlgSetBotMsg | ProgressDlgSetMeter | ProgressDlgStart | ProgressDlgEnd | ProgressDlgHasCancel | ProgressDlgYield

## Version
Availability: from Vectorworks 2015

## Category
* Utility